Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: བསྒྲུབ་པ་དང་། འཁོར་གསུམ་དག་པ་དང་། རྣམ་པ་གསུམ་གྱིས་བསྟན་ཏེ། སུམ་བརྒྱ་པ་ལས་གནས་པར་བྱ་བ་དང་བསྒྲུབ་པར་བྱ་བ་དང་། སེམས་རབ་ཏུ་གཟུང་བར་བྱ་བ་བསྟན་པ་ལྟ་བུའོ།
en: It teaches the practice of the perfections in three parts: standing, achieving, and the purity of the three spheres, just like “the stand” that has to be taken, “the achieving” that has to be done, and “the state of mind” one has to be in that is taught in the Triśatikā.

source: །དེ་ལས་གཞན་པའི་འབྲས་བུའི་ཁྱད་པར་འདོད་པ་ཡོངས་སུ་བཏང་སྟེ། སྙིང་རྗེའི་དབང་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་བསྒྲུབ་པར་བྱ་བའི་བསམ་པ་དང་། ཤེས་རབ་ཀྱི་དབང་གིས་ཁམས་གསུམ་པའམ། ཆོས་ཐམས་ཅད་ཀྱང་རུང་སྟེ་གང་ལ་ཡང་མི་གནས་པ་ནི་འདིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཞེས་བྱའོ།
en: When bodhisattvas have given up wanting a special result other than that; when, through the force of compassion, they intend to establish benefit and happiness for all beings; and when, through the force of wisdom, they stand nowhere at all in the three realms or in any dharma, bodhisattvas have “stood in the perfection of wisdom.”

source: །དེ་བས་ན་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Hence it says bodhisattvas have “stood in the perfection of wisdom by way of not taking their stand on it.”

source: མི་གནས་པའི་རིགས་པས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means “with the correct method of not taking a stand anywhere.”

source: །ཐམས་ཅད་ལ་གནས་པ་མེད་པ་གང་ཡིན་པ་དེ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཉིད་ཡིན་ནོ་ཞེས་དགོངས་པའོ།
en: This intends that just not taking a stand anywhere is standing in the perfection of wisdom.

source: །འདིར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམ། རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་བམ། ཐེག་པ་ཆེན་པོ་ཡིན་པར་བསྟན་ཏོ།
en: Here it has taught that the “perfection of wisdom” is also the knowledge of all aspects, or nonconceptual wisdom, or the Great Vehicle.

source: །བྱང་ཆུབ་ཀྱི་ལམ་དང་མཐུན་པར་ཡང་དག་པར་སྤྱོད་པ་ནི་སྒྲུབ་པ་སྟེ།
en: The practice through the force of habit in harmony with the path to awakening is the achieving.

source: དེ་བས་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་གསུངས་སོ།
en: Therefore it says a bodhisattva “should complete the perfection of giving.”

source: །དོན་དམ་པར་ཆོས་རྣམས་ལ་ཡོངས་སུ་བཙལ་ན་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཡིན་ཏེ། དེ་བས་ན་སྦྱིན་པར་བྱ་བ་དང་། གཏོང་བ་པོ་དང་། ལེན་པ་པོ་མི་དམིགས་པའི་ཕྱིར་ཡོངས་སུ་གཏོང་བ་མེད་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་གསུངས་སོ།
en: Ultimately, when dharmas have been sought, they are the purity of the three spheres; therefore, it says “by way of not giving up anything, because a gift, a giver, and a recipient are not apprehended.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་སྙིང་རྗེས་བསྐྱོད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཅི་འདོད་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་ཀྱང་དེའི་ཚེ་ནི་སྦྱིན་པ་ཞེས་བརྗོད་པར་ཟད་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཡིན་ནོ།
en: When bodhisattvas moved by compassion give to all beings everything they want, it is simply called giving, but it is not the perfection of giving.

source: །གང་གི་ཚེ་སྦྱིན་པར་བྱེད་པའམ་སྦྱིན་པ་བྱིན་པའི་འོག་ཏུ་ཡོངས་སུ་བཙལ་བ་བཞིས་ཡོངས་སུ་བཙལ་ཅིང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་བཞིས་ཡོངས་སུ་ཤེས་པར་བྱས་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་སྦྱོར་བར་བྱེད་པ་དེའི་ཚེ་ན། དེ་ལེགས་པར་སྦྱངས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་ཐོབ་པར་འགྱུར་རོ།
en: When after giving, or after the giving of a gift, having made an investigation with the four ways of investigating and having comprehended properly with the four comprehensions they cause it to be cleansed with wisdom, at that time it has been well cleansed and it gets the name perfection.

source: །བྱང་ཆུབ་སེམས་དཔའ་ནི་དང་པོར་སྙིང་རྗེས་ལས་ཐམས་ཅད་བྱས་ནས། ཕྱིས་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་སྦྱོང་ངོ་། །དེ་བས་ན་སྙིང་རྗེས་ནི་སྒྲུབ་པར་བྱེད་དོ། །ཤེས་རབ་ཀྱིས་ནི་དག་པར་བྱེད་དོ། །སྙིང་རྗེས་ནི་བསམ་པ་དག་པར་བྱེད་དོ།
en: Bodhisattvas first do everything out of compassion and later clean it with wisdom, hence they practice with compassion and purify with wisdom—they purify intention with compassion and purify the endeavor with wisdom; they stand in the conventional and achieve with compassion, and endeavor, standing in the ultimate, with wisdom.

source: །ཤེས་རབ་ཀྱིས་ནི་སྦྱོར་བ་དག་པར་བྱེད་དོ། །སྙིང་རྗེས་ནི་ཀུན་རྫོབ་ལ་གནས་ནས་སྒྲུབ་པར་བྱེད་དོ། །ཤེས་རབ་ཀྱིས་ནི་དོན་དམ་པ་ལ་གནས་ཏེ་སྦྱོར་བར་བྱེད་དོ། །སྙིང་རྗེས་ནི་ལས་ཐམས་ཅད་སེམས་ཅན་གྱི་དོན་དུ་བྱས་པའི་ཕྱིར་བསོད་ནམས་ཀྱི་ཚོགས་སུ་བགྲང་ངོ་། །ཤེས་རབ་ཀྱིས་ནི་བྱང་ཆུབ་ཀྱི་དོན་གྱི་ཕྱིར་ཡེ་ཤེས་ཀྱི་ཚོགས་སུ་བགྲང་ངོ་།
en: With compassion all things are done for the sake of beings, so they are counted in the merit collection; with wisdom they are done for the sake of awakening, so they are counted in the wisdom collection.

source: །དེ་བས་ན་ཡོངས་སུ་གཏོང་བ་མེད་པའི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་གསུངས་སོ།
en: Therefore it says that bodhisattvas “should complete the perfection of giving by way of not giving up anything.”

source: །འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ས་དང་པོ་ལ་དེ་བཞིན་ཉིད་རྟོགས་པ་ནས་བཟུང་སྟེ། སྦྱོར་བ་ཐམས་ཅད་ལ་དོན་དམ་པར་བཙལ་ན་མངོན་སུམ་དུ་མཐོང་བས་དེ་བཞིན་ཉིད་དུ་གནས་པར་འགྱུར་གྱི་གཞན་དུ་ནི་མ་ཡིན་ནོ།
en: In this regard, taking as the point of departure the fact that bodhisattvas standing on the first level realize suchness, ultimately abiding in suchness is by a direct vision when an investigation has been carried out, not otherwise.

source: །དེ་བཞིན་ཉིད་དེ་ཡང་སྦྱིན་པ་བྱེད་པའི་ཚེ་ནི་སུས་ཀྱང་སྦྱིན་པའམ་བླང་བར་མི་ནུས་ཏེ། དེ་བས་ན་དོན་དམ་པར་ཡོངས་སུ་གཏོང་བ་ཞེས་བྱ་བ་གང་ཡང་མེད་དོ།
en: Furthermore, no one can give or receive that suchness when a gift is given, so ultimately there is no “giving away” at all.

source: །བཟའ་བ་དང་བཏུང་བ་དང་མལ་ཆ་ལ་སོགས་པ་ཡོངས་སུ་གཏོང་བ་གང་ཡིན་པ་དེ་དག་ནི་ཀུན་བརྟག་པའི་ཆོས་ལ་གནས་པའི་ཕྱིར་རྨི་ལམ་དང་སྒྱུ་མ་བཞིན་དུ་ཡོད་པ་མ་ཡིན་ནོ།
en: Whatever food, drink, bedding, and so on are given away, they stand as falsely imagined dharmas, so, like a dream and like an illusion they do not exist.

source: །དེ་ལྟར་དོན་དམ་པར་ཡོངས་སུ་གཏོང་བའི་མཚན་ཉིད་དང་བྲལ་བ་ཉིད་ལ་ཡོངས་སུ་གཏོང་བ་མེད་པའི་ཚུལ་ཞེས་བྱའོ།
en: Hence this state, which is ultimately separated from the defining mark of giving, is called the “way of not giving up anything.”

source: །ཡོངས་སུ་གཏོང་བ་མེད་པའི་ཚུལ་དེས་དངོས་པོ་ལ་སྦྱིན་པར་བྱ་བ་དང་། བདག་ལ་གཏོང་བ་པོ་དང་། སློང་བ་ལ་ལེན་པར་བྱེད་པ་དང་གསུམ་མི་དམིགས་ཏེ།
en: In this “way of not giving up anything” these three “are not apprehended”: the thing as “a gift,” I as a “giver,” and the one taking as a “recipient.”

source: དམིགས་པའི་ངོ་བོ་ཉིད་དང་བྲལ་བ་ཉིད་དོ།
en: They are without the intrinsic nature of something that could be apprehended.

source: །ཕྱིར་ཞེས་བྱ་བ་ནི་བརྟེན་ཅིང་བཟུང་ནས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའོ།
en: The “because” is because the perfection of giving should be completed based on that, having taken that as its point of departure.

source: །དང་པོར་ནི་སྙིང་རྗེའི་སྟོབས་ཀྱིས་ཀུན་རྫོབ་ཀྱི་ཚུལ་ལ་གནས་ཏེ་འཇིག་རྟེན་པའི་སྤྱོད་པའི་དབང་གིས་སྦྱིན་པ་བྱེད་དོ།
en: First, through the force of compassion they remain in the conventional mode by means of an ordinary course of practice and engage in giving.

source: །དེ་ནས་ཤེས་རབ་ཀྱི་དབང་གིས་དོན་དམ་པའི་ཚུལ་ལ་གནས་ཏེ་འཇིག་རྟེན་ལས་འདས་པའི་སྤྱོད་པའི་དབང་གིས་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བཙལ་ན་དམིགས་སུ་མེད་པར་གྱུར་པ་དེའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱ་བའི་མིང་དུ་འགྱུར་རོ།
en: Then they remain in the ultimate mode governed by wisdom. When by means of an extraordinary course of practice all that has been investigated with wisdom cannot be apprehended, at that time the perfection of giving is named completed.

source: །དེ་བས་ན་དང་པོ་སེམས་བསྐྱེད་པའི་དམིགས་པར་གྱུར་པ་སེམས་ཅན་དང་། བྱང་ཆུབ་གཉིས་ཡོངས་སུ་མ་བཏང་བར་གྱུར་ཏེ། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་དག་པའི་དོན་དང་ལྡན་པར་འགྱུར་རོ།
en: Therefore, because they have not forsaken the two—first, the beings (sattva) who are the objective support of the production of the thought, and then awakening (bodhi)—they are endowed with all that the name bodhisattva signifies.

source: །དེ་ལྟར་ན་སྦྱིན་པར་བྱ་བ་དང་། གཏོང་བ་པོ་དང་། ལེན་པ་པོ་རྣམས་མི་དམིགས་པ་དང་། སྦྱིན་པ་དག་ཤིན་ཏུ་འགལ་བ་ཡིན་ན་ཇི་ལྟར་ན་འགལ་བ་མེད་པ་ལྟ་བུར་འགྱུར་ཞེ་ན།
en: In that case, since when a gift, a giver, and a recipient are not apprehended it totally precludes giving, how can this not be a contradiction?

source: ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོབས་ཀྱིས་འགྱུར་ཏེ།
en: It is because of the force of the perfection of skillful means.

source: ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཀུན་རྫོབ་འཛིན་པའི་སྙིང་རྗེ་དང་། དོན་དམ་པ་འཛིན་པའི་ཤེས་རབ་གཉིས་ཀྱིས་སྐམ་ལ་རྒྱུ་བ་དང་།
en: The perfection of skillful means is both compassion that grasps the conventional and wisdom that grasps the ultimate.

source: ཆུ་ན་རྒྱུ་བའི་སྲོག་ཆགས་ཀྱི་སྦྱོར་བ་བཞིན་དུ་སྦྱོར་བའི་ཁྱད་པར་ཤིན་ཏུ་འགལ་བ་ཡིན་དུ་ཟིན་ཀྱང་སྦྱོར་བའི་རྣམ་པས་འགལ་བ་མེད་པར་གྲོགས་བྱས་ནས་ཅིག་ཅར་སྒྲུབ་ཅིང་འཇུག་སྟེ།
en: They are companions that achieve and operate simultaneously, like the movement on dry land and movement in water engaged in by an amphibian. They totally preclude each other as different things it does but do not preclude each other as aspects of what it does.

source: བྱང་ཆུབ་ཀྱི་བར་དུ་བསོད་ནམས་ཀྱི་ཚོགས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཐམས་ཅད་སྒྲུབ་པ་ནི་བྱང་ཆུབ་དང་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པའི་མཆོག་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: This teaches that up until awakening the practice achieving all the merit accumulations and wisdom accumulations is the “supreme benefit of awakening and beings.”

source: །འོག་ནས་ཀྱང་སྐབས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་དེ་དག་འཆད་དོ།
en: These two will be explained again just as they are in the appropriate contexts. “

source: །ལྟུང་བ་མི་འབྱུང་བ་དང་། ལྷག་པར་ལྟུང་བ་མི་འབྱུང་བའི་ཕྱིར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྡོམ་པའི་བསླབ་པ་ཡང་དག་པར་བླངས་ཏེ་གནས། རབ་ཏུ་བྱུང་བ་ནི་སྡོམ་པའི་བསླབ་པ་གཉིས་ཀ་ཡང་དག་པར་བླངས་ཏེ་གནས་པ་ན་ལྟུང་བ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Should complete the perfection of morality because no downfall is incurred and no compounded downfall is incurred”— when bodhisattva householders take up and follow the training to do with the bodhisattva code of conduct, and those gone forth to homelessness take up and follow the trainings to do with both codes of conduct, they incur no downfall.

source: །གལ་ཏེ་ལྟུང་བ་བྱུང་ན་ཡང་དུས་ལས་ཡོལ་བར་ལྷག་པར་ལྟུང་བ་མི་འབྱུང་གི་མྱུར་ཞིང་མྱུར་དུ་མཐོལ་བར་བྱེད་དེ།
en: Even if they do incur a downfall, they do not compound it by letting time pass; they very quickly reveal it.

source: དེ་བས་ན་ལྟུང་བ་མི་འབྱུང་བ་དང་། ལྷག་པར་ལྟུང་བ་མི་འབྱུང་བའི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence it says, “no downfall is incurred and no compounded downfall is incurred.” “

source: །འདིར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བར་སྙེགས་ཏེ། བདག་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པའོ། །འདི་ནི་ཚུལ་ཁྲིམས་སོ། །འདི་ནི་འཆལ་བའི་ཚུལ་ཁྲིམས་སོ་ཞེས་བྱ་བའི་རྣམ་པར་རྟོག་པ་གསུམ་མི་དམིགས་པས་འཁོར་གསུམ་ཡོངས་སུ་དག་པར་རིག་པར་བྱ་སྟེ།
en: Having stood in the perfection of wisdom” comes right after this as well so it should be understood that on account of not apprehending the three conceptualizations—“I am moral,” “this is morality,” “this is immorality”—it is the purity of the three spheres.

source: འདི་ལྟར་འོག་ནས་ཀྱང་བདག་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པའོ། །འདི་ནི་ཚུལ་ཁྲིམས་སོ། །འདི་ནི་འཆལ་བའི་ཚུལ་ཁྲིམས་སོ་ཞེས་བྱ་བས་རློམ་སེམས་སུ་མི་བྱེད་དོ་ཞེས་འབྱུང་ངོ་།
en: Thus, below it will say, “They do not falsely project ‘I am moral, this is morality, this is immorality.’ ” “

source: །འཁྲུག་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ངོ་བོ་ཉིད་བསྟན་ཏེ།
en: Because there is no disturbance”— this teaches the nature of the perfection of patience.

source: དེ་ཡང་སྙིང་རྗེའི་དབང་གིས་སེམས་ཅན་ལ་འཁྲུག་པ་མེད་པ་དང་། ཤེས་རབ་ཀྱི་དབང་གིས་འདུ་བྱེད་རྣམས་ལ་བདག་མེད་པར་རྟོགས་པའི་ཕྱིར་རོ།
en: Furthermore, governed by compassion they are not disturbed by beings, and governed by wisdom they realize there is no self in the volitional factors.

source: །འདིར་ཡང་བཟོད་པ་དང་། བཟོད་པར་བྱ་བ་དང་། གནོད་སེམས་རྣམས་མི་དམིགས་པས་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ནི་འོག་ནས་སྐབས་ཇི་ལྟ་བ་ཉིད་དུ་འཆད་དོ།
en: Here also the purity of the three spheres on account of not apprehending patience, an object of patience, or malice will be explained again in the appropriate contexts. “

source: །ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཉམས་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་འདིས་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འཇུག་པ་བསྟན་ཏེ།
en: Because there is no relaxing of physical or mental effort”— this teaches engagement in the perfection of perseverance.

source: རྒྱུན་དུ་ཆུད་པ་དང་གུས་པ་དང་ནན་ཏན་དུ་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ཉམས་པར་མི་བྱེད་པར་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means bodhisattvas “should complete… the perfection of perseverance” with the perseverance that causes them not to relax from any physical or mental effort at persisting, respecting, and trying hard.

source: །མ་བཏང་བ་དེ་ཡང་ཤེས་རབ་དང་། སྙིང་རྗེ་ཉིད་ཀྱི་འགྱུར་བ་ཉིད་དོ།
en: Not giving up, furthermore, is from wisdom and compassion.

source: །འདིར་ཡང་བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། བརྩོན་འགྲུས་དང་ལེ་ལོ་རྣམས་མི་དམིགས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་དུ་འགྲུབ་པོ།
en: Here also the state of perfection is accomplished on account of not apprehending someone who has perseverence, perseverance, or laziness. “

source: །རོ་མྱང་བ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གལ་ཏེ་བདག་གི་དོན་དུ་བསམ་གཏན་ལ་འཇུག་ན་ནི་བསམ་གཏན་གྱི་རོ་མྱོང་བར་བྱེད་པར་འགྱུར་ན་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་གི་དོན་འབའ་ཞིག་ལ་སྦྱོར་བ་ཐམས་ཅད་ལ་སྡིག་པ་བཞིན་དུ་རྣམ་པར་སྨོད་པར་བྱེད་ན།
en: Because there is no experience”— if they enter into a concentration for their own sake it becomes the “experience” of a concentration. So, given that bodhisattvas spurn all practice done only for their own sake as a sin, how could they ever pay attention to the experience of a concentration?

source: དེ་ལ་བསམ་གཏན་གྱི་རོ་མྱང་བའི་ཡིད་ལ་བྱེད་པ་ལྟ་ག་ལ་ཡོད། དེ་བས་ན་ཉོན་མོངས་པ་ཅན་དང་། དག་པ་དང་ཟག་པ་མེད་པའི་བསམ་གཏན་གསུམ་ལས་དག་པ་དང་། ཟག་པ་མེད་པ་ཉིད་ལ་སྙོམས་པར་འཇུག་གི་ཉོན་མོངས་པ་ཅན་ལ་མི་འཇུག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: What it means to say is that of the three concentrations—defiled, purified, and without outflows—they become absorbed in purified concentrations and concentrations without outflows, not in defiled ones.

source: །འདིར་ཡང་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཡེང་པ་རྣམས་མི་དམིགས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Here also, on account of not apprehending someone in the concentration, the concentration, or distraction, the perfection becomes complete. “

source: །ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་དེ་བཞིན་ཉིད་ཙམ་དུ་མཐོང་བས་ནི་འཇིག་རྟེན་པའི་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་མི་དམིགས་ལ། འཇིག་རྟེན་ལས་འདས་པ་རྣམས་ལ་ཡང་རྣམ་པར་མི་རྟོག་སྟེ།
en: Because all phenomena are not apprehended”— when they see just reality, they do not apprehend any ordinary, falsely imagined phenomena, and they do not even conceive of the extraordinary ones either, whereby they “should complete the perfection of wisdom.”

source: དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅེ་ན།
en: How, standing in the perfection of wisdom, can they complete the perfection of wisdom?

source: གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ཐེག་པ་ཆེན་པོ་ལ་བྱ་བ་དེའི་ཚེ་ན་ནི་ཀླན་ཀར་འགྱུར་བ་མེད་དོ།
en: When “the perfection of wisdom” is work at the knowledge of all aspects and the Great Vehicle there is no fault.

source: །གང་གི་ཚེ་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བྱ་བར་གྱུར་པ་དེའི་ཚེ་ཡང་དོན་དམ་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཆོས་གང་ཡང་མེད་དོ་སྙམ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་རྟོག་པ་མེད་པའི་བདག་ཉིད་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ཡིན་ཏེ།
en: Still, when bodhisattvas are working on the perfection of nonconceptual wisdom, thinking “ultimately there is no perfection of wisdom dharma whatsoever,” they stand in the perfection of nonconceptual wisdom, the nature of which is the absence of the conceptualization of the perfection of wisdom.

source: དེའི་ཚེ་ནི་ཁམས་གསུམ་པ་ལ་སོགས་པ་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་དོ་སྙམ་དུ་ཀུན་རྫོབ་ཀྱི་རྣམ་པར་སྐྱེས་པའི་ཤེས་རབ་སྦྱོར་བའི་ལམ་དུ་རྟོགས་པ་ནི་རྣམ་པར་རྟོག་པའི་བདག་ཉིད་ཡིན་ཡང་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་ཟིན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: At that point, the wisdom produced in a conventional form, which thinks “the three realms and so on are simply just suchness,” is conceptual in nature, but as the path of preparation realization, since it is informed by the nonconceptual perfection of wisdom, it is called the perfection of wisdom.

source: དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པར་དགོངས་པས་ཀླན་ཀར་འགྱུར་བ་མེད་དོ།
en: Therefore there is no fault, because the intention is that bodhisattvas, standing in the perfection of wisdom, cultivate the perfection of wisdom.

source: །འདིར་ཡང་ཤེས་རབ་ཅན་དང་། ཤེས་རབ་དང་། འཆལ་བའི་ཤེས་རབ་རྣམས་མི་དམིགས་པས་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Here too it should be understood that on account of not apprehending someone who has wisdom, wisdom, or intellectual confusion, it is the purity of the three spheres.

source: །དེའི་འོག་ཏུ་ཤཱ་རིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་བྱ་བ་ལ་སོགས་པས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་སྤྱོད་པ་སྟོན་ཏོ།
en: Practice of the dharmas on the side of awakening Then, “Śāriputra, bodhisattva great beings, having stood in the perfection of wisdom, should perfect the four applications of mindfulness,” and so on, teaches the practice of the dharmas on the side of awakening.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒོམ་པ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བར་བྱེད་པ་རྣམས་ཉིད་ལ་རིགས་ཀྱི།
en: Qualm: The cultivation of the thirty-seven dharmas on the side of awakening is appropriate for those in the Śrāvaka and Pratyekabuddha Vehicles who strive for nirvāṇa but is not appropriate for bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མི་རིགས་སོ་ཞེ་ན་ཡང་འདི་ལ་ཉེས་པ་མེད་དེ།
en: Response: There is no fault here.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་རྟོགས་པར་བཞེད་པ་དང་། ཆོས་ཐམས་ཅད་མི་དམིགས་པར་ལྷུར་ལེན་པས་ཅི་བྱང་ཆུབ་ཀྱི་ཆོས་རྣམས་དོན་དམ་པར་ཡོད་དམ། འོན་ཏེ་མེད་ཅེས་དེ་དག་ལ་ཡོངས་སུ་ཚོལ་བས་རིགས་སོ།
en: Bodhisattvas want to realize all dharmas in all forms and are intent on not apprehending all dharmas, so, because they investigate whether the awakening dharmas do or do not exist ultimately, it is appropriate.

source: །འོ་ན་དེ་ལྟར་གྱུར་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒོམས་པའི་རྒྱུར་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་མཛད་པར་འགྱུར་ཏེ།
en: Qualm: Nevertheless, in that case, having cultivated the dharmas on the side of awakening they become a cause for their actualizing nirvāṇa.

source: དེའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་རྒྱུན་དུ་ཞུགས་པ་ནས་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་འགྱུར་རོ་ཞེ་ན། ཡང་སྔོན་གྱི་རྩོལ་བའི་ཤུགས་ཀྱི་མཐུ་ཉིད་ཀྱིས་དེ་འགྲུབ་པར་འདི་ལ་ཉེས་པ་མེད་དེ།
en: Bodhisattvas therefore will become stream enterers, up to worthy ones. Response: They are accomplished because of the power of the force of an earlier endeavor, so there is no fault in it.

source: ཡང་གང་དག་འཁོར་བ་ལ་ཉེས་དམིགས་སུ་མཐོང་ནས་ཡིད་བྱུང་བ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་ཡོན་ཏན་དུ་མཐོང་ནས་དེ་ཉིད་དོན་དུ་གཉེར་ཅིང་སྒྲུབ་པ་དེ་དག་ནི་སྔོན་གྱི་རྩོལ་བའི་ཤུགས་ཀྱིས་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་བསྒོམས་པའི་རྒྱུས་འབད་མི་དགོས་པར་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་བྱེད་པར་འགྱུར་གྱི།
en: Still, those who see faults in saṃsāra and feel repulsion, and strive for and accomplish nirvāṇa having seen its good qualities, effortlessly actualize nirvāṇa because of the force of an earlier endeavor, on account of the cause—their meditation on the applications of mindfulness.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་སེམས་མཉམ་པ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བ་བསྐྱེད་པ་ལྷུར་ལེན་པ་དག་ནི་སེམས་ཅན་ལ་ཕན་པའི་རྒྱུ་ཡིན་པའི་ཕྱིར་འཁོར་བ་ལ་ཡང་མྱ་ངན་ལས་འདས་པ་བཞིན་དུ་ཡོན་ཏན་དུ་གཟིགས་ལ་སེམས་ཅན་ལ་ཕན་འདོགས་པའི་གནས་པ་མ་ཡིན་པའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་འཁོར་བ་བཞིན་དུ་མི་མཐུན་པར་གཟིགས་པ་དང་།
en: Bodhisattvas, however, regard saṃsāra and nirvāṇa equally. They are intent on producing benefit and happiness for all beings, so they see good qualities in saṃsāra because it is the cause for the benefit of beings, like nirvāṇa; and they see nirvāṇa as disagreeable, like saṃsāra, because it is not a place to stand to be of benefit to beings.

source: ཆོས་ཉིད་ཙམ་དུ་ཟད་པའི་ཕྱིར་དེ་གཉི་ག་ཡང་མཉམ་པ་ཉིད་དུ་གཟིགས་པས་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་དུ་སོ་སོར་རྟོག་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒོམས་ཏེ།
en: They see them as equal because they are both merely the true nature of dharmas. So they have meditated on the dharmas on the side of awakening in order to understand analytically that they cannot be apprehended.

source: དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མངོན་སུམ་དུ་མཛད་པ་ཁོ་ན་ཙམ་དུ་ཟད་ཀྱི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པའམ། མྱ་ངན་ལས་འདས་པ་ལ་མངོན་སུམ་དུ་མཛད་པའི་ཕྱིར་ཉེ་བར་མཛད་པ་མ་ཡིན་ཏེ།
en: They do it simply to actualize the dharmas on the side of awakening. They do not work on them in order to realize the result of stream enterer and so on, or nirvāṇa.

source: དེ་ཉིད་ལ་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པ་ཞེས་བྱའོ།
en: Just that is “knowledge of mastery.”

source: །འདི་ལྟར་འོག་ནས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་གནས་ནས་འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱ་བའི་དུས་ཡིན་གྱི་མངོན་སུམ་དུ་བྱ་བའི་དུས་ནི་མ་ཡིན་པར་ཤེས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཡོངས་སུ་འདྲིས་པའི་ཤེས་པ་བསྟན་པ་ལས་འཆད་དོ།
en: It will also be explained like this in the teaching on the knowledge of mastery where it will say that “they remain with the dharmas on the side of awakening, understanding that it is thus the time for mastery, and it is not the time for actualization.”

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་བ་ནི་དེ་ལ་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་ཆོས་རྣམས་དང་།
en: There are four objects to which mindfulness is applied: body, feelings, mind, and dharmas.

source: རྣམ་པ་བཞི་རྣམས་ལ་རྗེས་སུ་ལྟ་བ་རྣམ་པ་བཞི་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱ་སྟེ། སྔར་ཡོངས་སུ་ཤེས་པར་མཛད་ནས་དེའི་འོག་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཚོལ་བ་ན། ལུས་དང་།
en: The four observations of those four are “the four applications of mindfulness.”

source: ཚོར་བ་དང་། སེམས་དང་ཆོས་རྣམས་དང་། དེ་དག་ལ་དམིགས་པའི་དྲན་པ་དང་། ཤེས་རབ་གཉིས་དང་། དེ་དང་མཚུངས་པར་ལྡན་པའི་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀུན་བརྟགས་པའི་མཚན་ཉིད་དུ་ཐུགས་སུ་ཆུད་པས་ཡང་དག་པའི་དོན་མ་ཡིན་པར་ཡོངས་སུ་ཤེས་པར་མཛད་དེ།
en: Having come to know them previously, when bodhisattvas then search for them as they really are, they comprehend that body, feelings, mind, and dharmas, the mindfulness and wisdom focused on them, as well as the mental factor dharmas associated with them, are marked as falsely imagined, and they understand that they are not in fact real.

source: དོན་དམ་པ་བརྗོད་དུ་མེད་པ་ནི་དྲན་པ་དང་། ཤེས་རབ་གཉིས་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་པས་དྲན་པ་ཉེ་བར་གཞག་པའི་མཚན་ཉིད་ནི་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་པར་རྟོགས་པ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་མཛད་ཅེས་བྱའོ།
en: Since the inexpressible ultimate is not within the range of either mindfulness or wisdom, the bodhisattvas realize that ultimately there are no defining marks of the applications of mindfulness, and thus stand in the perfection of wisdom and “perfect the four applications of mindfulness.”

source: །དེ་བས་ན་འབུམ་པ་ལས་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དམིགས་སུ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore the One Hundred Thousand also says “because the applications of mindfulness cannot be apprehended.”

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་བསྒོམ་པ་འདི་ཡང་འོག་ནས་ཐེག་པ་ཆེན་པོ་བསྟན་པ་ལས་རྒྱས་པར་སྟོན་ཏོ།
en: I will give a detailed explanation of meditation on the dharmas on the side of awakening later as part of the exposition of the Great Vehicle.

source: །དེ་བཞིན་དུ་ཡང་དག་པའི་སྤོང་བ་རྣམས་ལ་ཡང་སྦྱར་བར་བྱ་སྟེ།
en: Construe the right efforts like this as well.

source: ཡང་དག་པའི་སྤོང་བ་ལ་སོགས་པའི་མཚན་ཉིད་ཀུན་རྫོབ་ཙམ་དུ་ཟད་ཀྱི།
en: It is saying that the defining marks of the right efforts and so on are simply mere conventions, but ultimately the defining marks of the right efforts and so on have nonexistence for their intrinsic nature.
